<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//RU"  
  "http://www.w3.org/TR/html4/loose.dtd">  
<html xml:lang="ru" > 
<head><title></title> 
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-5"> 
<meta name="generator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<meta name="originator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<!-- html --> 
<meta name="src" content="tempTex.tex"> 
<meta name="date" content="2018-05-07 00:49:00"> 
<link rel="stylesheet" type="text/css" href="tempTex.css"> 
</head><body 
>
<!--l. 9--><p class="noindent" >&#x0421;&#x0442;&#x0443;&#x0434;&#x0435;&#x043D;&#x0442; &#x0412;&#x044F;&#x0447;&#x0435;&#x0441;&#x043B;&#x0430;&#x0432; &#x0441;&#x0438;&#x0434;&#x0435;&#x043B; &#x043D;&#x0430; &#x043E;&#x0447;&#x0435;&#x0440;&#x0435;&#x0434;&#x043D;&#x043E;&#x0439; &#x0441;&#x043A;&#x0443;&#x0447;&#x043D;&#x043E;&#x0439; &#x043F;&#x0430;&#x0440;&#x0435; &#x043C;&#x0430;&#x0442;&#x0430;&#x043D;&#x0430;&#x043B;&#x0438;&#x0437;&#x0430;. &#x0421;&#x043A;&#x0440;&#x0435;&#x0431;&#x043A;&#x043E;
&#x042D;&#x043B;&#x0435;&#x043E;&#x043D;&#x043E;&#x0440;&#x0430; &#x041D;&#x0438;&#x043A;&#x043E;&#x043B;&#x0430;&#x0435;&#x0432;&#x043D;&#x0430; &#8212; &#x0435;&#x0433;&#x043E; &#x043F;&#x0440;&#x0435;&#x043F;&#x043E;&#x0434;&#x0430;&#x0432;&#x0430;&#x0442;&#x0435;&#x043B;&#x044C;, &#x0441;&#x0435;&#x0433;&#x043E;&#x0434;&#x043D;&#x044F; &#x043D;&#x0430;&#x0447;&#x0430;&#x043B;&#x0430; &#x043D;&#x043E;&#x0432;&#x0443;&#x044E; &#x0442;&#x0435;&#x043C;&#x0443; &#8212;
&#x043F;&#x043E;&#x0441;&#x043B;&#x0435;&#x0434;&#x043E;&#x0432;&#x0430;&#x0442;&#x0435;&#x043B;&#x044C;&#x043D;&#x043E;&#x0441;&#x0442;&#x0438;. &#x0412;&#x043E; &#x0432;&#x0440;&#x0435;&#x043C;&#x044F; &#x043F;&#x0430;&#x0440;&#x044B; &#x043E;&#x043D;&#x0430; &#x0434;&#x0430;&#x043B;&#x0430; &#x043C;&#x043D;&#x043E;&#x0436;&#x0435;&#x0441;&#x0442;&#x0432;&#x043E; &#x0444;&#x043E;&#x0440;&#x043C;&#x0443;&#x043B; &#x043E;&#x0431;&#x0440;&#x0430;&#x0437;&#x0443;&#x044E;&#x0449;&#x0438;&#x0445;
&#x043F;&#x043E;&#x0441;&#x043B;&#x0435;&#x0434;&#x043E;&#x0432;&#x0430;&#x0442;&#x0435;&#x043B;&#x044C;&#x043D;&#x043E;&#x0441;&#x0442;&#x0438;, &#x0438; &#x043F;&#x0440;&#x0438;&#x043C;&#x0435;&#x0440;&#x044B; &#x043A; &#x043D;&#x0438;&#x043C;...
<!--l. 11--><p class="indent" >   &#x0412; &#x043A;&#x043E;&#x043D;&#x0446;&#x0435; &#x043F;&#x0430;&#x0440;&#x044B; &#x042D;&#x043B;&#x0435;&#x043E;&#x043D;&#x043E;&#x0440;&#x0430; &#x041D;&#x0438;&#x043A;&#x043E;&#x043B;&#x0430;&#x0435;&#x0432;&#x043D;&#x0430; &#x0434;&#x0430;&#x043B;&#x0430; &#x0437;&#x0430;&#x0434;&#x0430;&#x043D;&#x0438;&#x0435; &#x043D;&#x0430; &#x0434;&#x043E;&#x043C;: &#x043D;&#x0435;&#x043E;&#x0431;&#x0445;&#x043E;&#x0434;&#x0438;&#x043C;&#x043E; &#x0431;&#x044B;&#x043B;&#x043E;
&#x043D;&#x0430;&#x0439;&#x0442;&#x0438; &#x043F;&#x0435;&#x0440;&#x0432;&#x044B;&#x0439; &#x0447;&#x043B;&#x0435;&#x043D; &#x043F;&#x043E;&#x0441;&#x043B;&#x0435;&#x0434;&#x043E;&#x0432;&#x0430;&#x0442;&#x0435;&#x043B;&#x044C;&#x043D;&#x043E;&#x0441;&#x0442;&#x0438;, &#x0437;&#x043D;&#x0430;&#x044F; &#x0442;&#x043E;&#x043B;&#x044C;&#x043A;&#x043E;: &#x0434;&#x043B;&#x0438;&#x043D;&#x0443; &#x043F;&#x043E;&#x0441;&#x043B;&#x0435;&#x0434;&#x043E;&#x0432;&#x0430;&#x0442;&#x0435;&#x043B;&#x044C;&#x043D;&#x043E;&#x0441;&#x0442;&#x0438;,
&#x043F;&#x043E;&#x0441;&#x043B;&#x0435;&#x0434;&#x043D;&#x0438;&#x0439; &#x0438; &#x043F;&#x0440;&#x0435;&#x0434;&#x043F;&#x043E;&#x0441;&#x043B;&#x0435;&#x0434;&#x043D;&#x0438;&#x0439; &#x0435;&#x0435; &#x0447;&#x043B;&#x0435;&#x043D;&#x044B;. &#x041E;&#x043D;&#x0430; &#x0434;&#x0430;&#x043B;&#x0430; &#x043C;&#x043D;&#x043E;&#x0436;&#x0435;&#x0441;&#x0442;&#x0432;&#x043E; &#x0442;&#x0430;&#x043A;&#x0438;&#x0445; &#x0437;&#x0430;&#x0434;&#x0430;&#x0447;
&#x0438; &#x0432; &#x043A;&#x043E;&#x043D;&#x0446;&#x0435; &#x043D;&#x0430;&#x043F;&#x0438;&#x0441;&#x0430;&#x043B;&#x0430; &#x0444;&#x043E;&#x0440;&#x043C;&#x0443;&#x043B;&#x0443; &#x043F;&#x043E; &#x043A;&#x043E;&#x0442;&#x043E;&#x0440;&#x043E;&#x0439; &#x0432;&#x044B;&#x0447;&#x0438;&#x0441;&#x043B;&#x044F;&#x044E;&#x0442;&#x0441;&#x044F; &#x0447;&#x043B;&#x0435;&#x043D;&#x044B; &#x044D;&#x0442;&#x0438;&#x0445;
&#x043F;&#x043E;&#x0441;&#x043B;&#x0435;&#x0434;&#x043E;&#x0432;&#x0430;&#x0442;&#x0435;&#x043B;&#x044C;&#x043D;&#x043E;&#x0441;&#x0442;&#x0435;&#x0439;
   <center class="math-display" >
<img 
src="tempTex0x.png" alt="pi = (pi&minus; 1 + pi&minus; 2)
" class="math-display" ></center>
<!--l. 14--><p class="indent" >   &#x0427;&#x0442;&#x043E;&#x0431;&#x044B; &#x043F;&#x043E;&#x0434;&#x0433;&#x043E;&#x0442;&#x043E;&#x0432;&#x0438;&#x0442;&#x044C;&#x0441;&#x044F; &#x043A; &#x0441;&#x043B;&#x0435;&#x0434;&#x0443;&#x044E;&#x0449;&#x0435;&#x0439; &#x043F;&#x0430;&#x0440;&#x0435;, &#x043A;&#x043E;&#x0442;&#x043E;&#x0440;&#x0430;&#x044F; &#x0431;&#x0443;&#x0434;&#x0435;&#x0442; &#x0443;&#x0436;&#x0435; &#x0437;&#x0430;&#x0432;&#x0442;&#x0440;&#x0430;,
&#x0412;&#x044F;&#x0447;&#x0435;&#x0441;&#x043B;&#x0430;&#x0432;&#x0443; &#x043D;&#x0435;&#x043E;&#x0431;&#x0445;&#x043E;&#x0434;&#x0438;&#x043C;&#x043E; &#x0440;&#x0435;&#x0448;&#x0438;&#x0442;&#x044C; &#x044D;&#x0442;&#x0438; &#x0437;&#x0430;&#x0434;&#x0430;&#x0447;&#x0438;, &#x043D;&#x043E; &#x043E;&#x043D; &#x043E;&#x0447;&#x0435;&#x043D;&#x044C; &#x0442;&#x043E;&#x0440;&#x043E;&#x043F;&#x0438;&#x0442;&#x0441;&#x044F; &#x043D;&#x0430; &#x0434;&#x0435;&#x043D;&#x044C;
&#x0440;&#x043E;&#x0436;&#x0434;&#x0435;&#x043D;&#x0438;&#x044F; &#x043A; &#x0434;&#x0440;&#x0443;&#x0433;&#x0443;, &#x043F;&#x043E;&#x044D;&#x0442;&#x043E;&#x043C;&#x0443; &#x043F;&#x0440;&#x043E;&#x0441;&#x0438;&#x0442; &#x0432;&#x0430;&#x0441; &#x043F;&#x043E;&#x043C;&#x043E;&#x0447;&#x044C; &#x0435;&#x043C;&#x0443;
    
</body></html> 



