<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//RU"  
  "http://www.w3.org/TR/html4/loose.dtd">  
<html xml:lang="ru" > 
<head><title></title> 
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-5"> 
<meta name="generator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<meta name="originator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<!-- html --> 
<meta name="src" content="tempTex.tex"> 
<meta name="date" content="2018-05-07 00:47:00"> 
<link rel="stylesheet" type="text/css" href="tempTex.css"> 
</head><body 
>
<!--l. 9--><p class="noindent" >Input:
<!--l. 11--><p class="indent" >   &#x0412; &#x043F;&#x0435;&#x0440;&#x0432;&#x043E;&#x0439; &#x0441;&#x0442;&#x0440;&#x043E;&#x043A;&#x0435; &#x0432;&#x0445;&#x043E;&#x0434;&#x043D;&#x044B;&#x0445; &#x0434;&#x0430;&#x043D;&#x043D;&#x044B;&#x0445; &#x0434;&#x0430;&#x043D;&#x044B; &#x0434;&#x0432;&#x0430; &#x0446;&#x0435;&#x043B;&#x044B;&#x0445; &#x0447;&#x0438;&#x0441;&#x043B;&#x0430; <span 
class="cmmi-10">n </span>&#x0438; <span 
class="cmmi-10">m </span>&#8212; &#x043A;&#x043E;&#x043B;&#x0438;&#x0447;&#x0435;&#x0441;&#x0442;&#x0432;&#x043E;
&#x0433;&#x043E;&#x0440;&#x043E;&#x0434;&#x043E;&#x0432; &#x0438; &#x0434;&#x043E;&#x0440;&#x043E;&#x0433; &#x0432; &#x0441;&#x0442;&#x0440;&#x0430;&#x043D;&#x0435; (<span 
class="cmr-10">1 </span><span 
class="msam-10">&le; </span><span 
class="cmmi-10">n </span><span 
class="msam-10">&le; </span><span 
class="cmr-10">500</span>, <span 
class="cmr-10">0 </span><span 
class="msam-10">&le; </span><span 
class="cmmi-10">m </span><span 
class="msam-10">&le; </span><span 
class="cmr-10">2000</span>). &#x0412; &#x043F;&#x043E;&#x0441;&#x043B;&#x0435;&#x0434;&#x0443;&#x044E;&#x0449;&#x0438;&#x0445; <span 
class="cmmi-10">n </span>&#x0441;&#x0442;&#x0440;&#x043E;&#x043A;&#x0430;&#x0445;
&#x0441;&#x043E;&#x0434;&#x0435;&#x0440;&#x0436;&#x0438;&#x0442;&#x0441;&#x044F; &#x0442;&#x0430;&#x0431;&#x043B;&#x0438;&#x0446;&#x0430; &#x043A;&#x0440;&#x0430;&#x0442;&#x0447;&#x0430;&#x0439;&#x0448;&#x0438;&#x0445; &#x0440;&#x0430;&#x0441;&#x0441;&#x0442;&#x043E;&#x044F;&#x043D;&#x0438;&#x0439; &#x043C;&#x0435;&#x0436;&#x0434;&#x0443; &#x043A;&#x0430;&#x0436;&#x0434;&#x043E;&#x0439; &#x043F;&#x0430;&#x0440;&#x043E;&#x0439; &#x0433;&#x043E;&#x0440;&#x043E;&#x0434;&#x043E;&#x0432;,
&#x044D;&#x043B;&#x0435;&#x043C;&#x0435;&#x043D;&#x0442;&#x044B; &#x0442;&#x0430;&#x0431;&#x043B;&#x0438;&#x0446;&#x044B; &#8212; &#x0446;&#x0435;&#x043B;&#x044B;&#x0435; &#x043D;&#x0435;&#x043E;&#x0442;&#x0440;&#x0438;&#x0446;&#x0430;&#x0442;&#x0435;&#x043B;&#x044C;&#x043D;&#x044B;&#x0435; &#x0447;&#x0438;&#x0441;&#x043B;&#x0430;, &#x043D;&#x0435; &#x043F;&#x0440;&#x0435;&#x0432;&#x044B;&#x0448;&#x0430;&#x044E;&#x0449;&#x0438;&#x0435;
<span 
class="cmr-10">10</span><sup><span 
class="cmr-7">6</span></sup>.
<!--l. 13--><p class="indent" >   Output:
<!--l. 15--><p class="indent" >   &#x0415;&#x0441;&#x043B;&#x0438; &#x0442;&#x0430;&#x043A;&#x0430;&#x044F; &#x0441;&#x0435;&#x0442;&#x044C; &#x0441;&#x0443;&#x0449;&#x0435;&#x0441;&#x0442;&#x0432;&#x0443;&#x0435;&#x0442;, &#x0432;&#x044B;&#x0432;&#x0435;&#x0434;&#x0438;&#x0442;&#x0435; &#x0432; &#x043F;&#x0435;&#x0440;&#x0432;&#x043E;&#x0439; &#x0441;&#x0442;&#x0440;&#x043E;&#x043A;&#x0435; &#x0441;&#x043E;&#x043E;&#x0431;&#x0449;&#x0435;&#x043D;&#x0438;&#x0435; «<span 
class="latt-1000">YES</span>» (&#x0431;&#x0435;&#x0437;
&#x043A;&#x0430;&#x0432;&#x044B;&#x0447;&#x0435;&#x043A;), &#x0432; &#x043F;&#x0440;&#x043E;&#x0442;&#x0438;&#x0432;&#x043D;&#x043E;&#x043C; &#x0441;&#x043B;&#x0443;&#x0447;&#x0430;&#x0435; &#8212; &#x0441;&#x043E;&#x043E;&#x0431;&#x0449;&#x0435;&#x043D;&#x0438;&#x0435; «<span 
class="latt-1000">NO</span>» (&#x0431;&#x0435;&#x0437; &#x043A;&#x0430;&#x0432;&#x044B;&#x0447;&#x0435;&#x043A;). &#x0415;&#x0441;&#x043B;&#x0438; &#x0441;&#x0435;&#x0442;&#x044C;
&#x0441;&#x0443;&#x0449;&#x0435;&#x0441;&#x0442;&#x0432;&#x0443;&#x0435;&#x0442;, &#x0442;&#x043E;, &#x043D;&#x0430;&#x0447;&#x0438;&#x043D;&#x0430;&#x044F; &#x0441;&#x043E; &#x0432;&#x0442;&#x043E;&#x0440;&#x043E;&#x0439; &#x0441;&#x0442;&#x0440;&#x043E;&#x043A;&#x0438;, &#x0432;&#x044B;&#x0432;&#x0435;&#x0434;&#x0438;&#x0442;&#x0435; <span 
class="cmmi-10">m </span>&#x0442;&#x0440;&#x043E;&#x0435;&#x043A; &#x0446;&#x0435;&#x043B;&#x044B;&#x0445; &#x0447;&#x0438;&#x0441;&#x0435;&#x043B;,
&#x043E;&#x043F;&#x0438;&#x0441;&#x044B;&#x0432;&#x0430;&#x044E;&#x0449;&#x0438;&#x0445; &#x0443;&#x0447;&#x0430;&#x0441;&#x0442;&#x043A;&#x0438; &#x0436;&#x0435;&#x043B;&#x0435;&#x0437;&#x043D;&#x043E;&#x0439; &#x0434;&#x043E;&#x0440;&#x043E;&#x0433;&#x0438;. &#x041A;&#x0430;&#x0436;&#x0434;&#x044B;&#x0439; &#x0443;&#x0447;&#x0430;&#x0441;&#x0442;&#x043E;&#x043A; &#x0436;&#x0435;&#x043B;&#x0435;&#x0437;&#x043D;&#x043E;&#x0439; &#x0434;&#x043E;&#x0440;&#x043E;&#x0433;&#x0438;
&#x043E;&#x043F;&#x0438;&#x0441;&#x044B;&#x0432;&#x0430;&#x0435;&#x0442;&#x0441;&#x044F; &#x043D;&#x043E;&#x043C;&#x0435;&#x0440;&#x0430;&#x043C;&#x0438; &#x0433;&#x043E;&#x0440;&#x043E;&#x0434;&#x043E;&#x0432;, &#x043A;&#x043E;&#x0442;&#x043E;&#x0440;&#x044B;&#x0435; &#x0438;&#x043C; &#x0441;&#x043E;&#x0435;&#x0434;&#x0438;&#x043D;&#x044F;&#x044E;&#x0442;&#x0441;&#x044F; &#x0438; &#x0435;&#x0433;&#x043E; &#x0434;&#x043B;&#x0438;&#x043D;&#x0443;. &#x0414;&#x043B;&#x0438;&#x043D;&#x0430;
&#x043B;&#x044E;&#x0431;&#x043E;&#x0433;&#x043E; &#x0443;&#x0447;&#x0430;&#x0441;&#x0442;&#x043A;&#x0430; &#x0434;&#x043E;&#x043B;&#x0436;&#x043D;&#x0430; &#x0431;&#x044B;&#x0442;&#x044C; <span 
class="labx-1000">&#x043F;&#x043E;&#x043B;&#x043E;&#x0436;&#x0438;&#x0442;&#x0435;&#x043B;&#x044C;&#x043D;&#x0430; </span>&#x0438; &#x043D;&#x0435; &#x0434;&#x043E;&#x043B;&#x0436;&#x043D;&#x0430; &#x043F;&#x0440;&#x0435;&#x0432;&#x044B;&#x0448;&#x0430;&#x0442;&#x044C; <span 
class="cmr-10">10</span><sup><span 
class="cmr-7">6</span></sup>.
 
</body></html> 



