<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//RU"  
  "http://www.w3.org/TR/html4/loose.dtd">  
<html xml:lang="ru" > 
<head><title></title> 
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-5"> 
<meta name="generator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<meta name="originator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<!-- html --> 
<meta name="src" content="tempTex.tex"> 
<meta name="date" content="2018-05-07 00:56:00"> 
<link rel="stylesheet" type="text/css" href="tempTex.css"> 
</head><body 
>
<!--l. 9--><p class="noindent" >&#x041E;&#x043B;&#x0435;&#x0441;&#x044F; &#x0438; &#x041D;&#x0430;&#x0441;&#x0442;&#x044F; &#x0443;&#x0447;&#x0430;&#x0441;&#x0442;&#x0432;&#x0443;&#x044E;&#x0442; &#x0432; &#x043A;&#x043E;&#x043D;&#x043A;&#x0443;&#x0440;&#x0441;&#x0435; &#x0441;&#x0430;&#x043C;&#x044B;&#x0445; &#x043A;&#x0440;&#x0430;&#x0441;&#x0438;&#x0432;&#x044B;&#x0445; &#x043C;&#x0430;&#x0441;&#x0441;&#x0438;&#x0432;&#x043E;&#x0432;. &#x041A;&#x0430;&#x043A; &#x0438;&#x0437;&#x0432;&#x0435;&#x0441;&#x0442;&#x043D;&#x043E;,
&#x0441;&#x0430;&#x043C;&#x044B;&#x0435; &#x043A;&#x0440;&#x0430;&#x0441;&#x0438;&#x0432;&#x044B;&#x0435; &#x043C;&#x0430;&#x0441;&#x0441;&#x0438;&#x0432;&#x044B; &#8212; &#x0442;&#x0435;, &#x0432; &#x043A;&#x043E;&#x0442;&#x043E;&#x0440;&#x044B;&#x0445; &#x044D;&#x043B;&#x0435;&#x043C;&#x0435;&#x043D;&#x0442;&#x044B; &#x0440;&#x0430;&#x0441;&#x043F;&#x043E;&#x043B;&#x043E;&#x0436;&#x0435;&#x043D;&#x044B; &#x0432; &#x043F;&#x043E;&#x0440;&#x044F;&#x0434;&#x043A;&#x0435;
&#x043D;&#x0435;&#x0443;&#x0431;&#x044B;&#x0432;&#x0430;&#x043D;&#x0438;&#x044F;.
<!--l. 11--><p class="indent" >   &#x041D;&#x0435;&#x0441;&#x043A;&#x043E;&#x043B;&#x044C;&#x043A;&#x043E; &#x043D;&#x0435;&#x0434;&#x0435;&#x043B;&#x044C; &#x043F;&#x0440;&#x043E;&#x0434;&#x043E;&#x043B;&#x0436;&#x0430;&#x043B;&#x0441;&#x044F; &#x044D;&#x0442;&#x043E;&#x0442; &#x043A;&#x043E;&#x043D;&#x043A;&#x0443;&#x0440;&#x0441;, &#x0438; &#x0432;&#x043E;&#x0442;, &#x043D;&#x0430;&#x043A;&#x043E;&#x043D;&#x0435;&#x0446;, &#x043D;&#x0430;&#x0441;&#x0442;&#x0443;&#x043F;&#x0438;&#x043B;
&#x0434;&#x043E;&#x043B;&#x0433;&#x043E;&#x0436;&#x0434;&#x0430;&#x043D;&#x043D;&#x044B;&#x0439; &#x0444;&#x0438;&#x043D;&#x0430;&#x043B;. &#x0412; &#x043A;&#x0430;&#x0447;&#x0435;&#x0441;&#x0442;&#x0432;&#x0435; &#x0437;&#x0430;&#x0434;&#x0430;&#x043D;&#x0438;&#x044F; &#x043D;&#x0430; &#x0444;&#x0438;&#x043D;&#x0430;&#x043B; &#x043E;&#x0440;&#x0433;&#x0430;&#x043D;&#x0438;&#x0437;&#x0430;&#x0442;&#x043E;&#x0440;&#x044B; &#x0434;&#x0430;&#x043B;&#x0438;
&#x0443;&#x0447;&#x0430;&#x0441;&#x0442;&#x043D;&#x0438;&#x043A;&#x0430;&#x043C; &#x043E;&#x0433;&#x0440;&#x043E;&#x043C;&#x043D;&#x044B;&#x0439; &#x043C;&#x0430;&#x0441;&#x0441;&#x0438;&#x0432; <span 
class="cmmi-10">q</span>, &#x0441;&#x043E;&#x0441;&#x0442;&#x043E;&#x044F;&#x0449;&#x0438;&#x0439; &#x0438;&#x0437; <span 
class="cmmi-10">n </span>&#x044D;&#x043B;&#x0435;&#x043C;&#x0435;&#x043D;&#x0442;&#x043E;&#x0432;.
<!--l. 13--><p class="indent" >   &#x041C;&#x0430;&#x0441;&#x0441;&#x0438;&#x0432; <span 
class="cmmi-10">q</span>, &#x043A;&#x043E;&#x0442;&#x043E;&#x0440;&#x044B;&#x0439; &#x0431;&#x044B;&#x043B; &#x043F;&#x0440;&#x0435;&#x0434;&#x043B;&#x043E;&#x0436;&#x0435;&#x043D; &#x043E;&#x0440;&#x0433;&#x0430;&#x043D;&#x0438;&#x0437;&#x0430;&#x0442;&#x043E;&#x0440;&#x0430;&#x043C;&#x0438;, &#x0437;&#x0430;&#x043F;&#x043E;&#x043B;&#x043D;&#x044F;&#x0435;&#x0442;&#x0441;&#x044F; &#x0437;&#x043D;&#x0430;&#x0447;&#x0435;&#x043D;&#x0438;&#x044F;&#x043C;&#x0438;
&#x043F;&#x043E; &#x043F;&#x0440;&#x0430;&#x0432;&#x0438;&#x043B;&#x0443;:
<!--l. 15--><p class="indent" >
   <center class="math-display" >
<img 
src="tempTex0x.png" alt="qi = (ai modb)  modc
" class="math-display" ></center>
<!--l. 17--><p class="indent" >   &#x0433;&#x0434;&#x0435;   <span 
class="cmr-10">mod</span><span style="margin-left:0.3em" class="thinspace"></span><span style="margin-left:0.3em" class="thinspace"></span> &#x043E;&#x0431;&#x043E;&#x0437;&#x043D;&#x0430;&#x0447;&#x0430;&#x0435;&#x0442; &#x043E;&#x043F;&#x0435;&#x0440;&#x0430;&#x0446;&#x0438;&#x044E; &#x0432;&#x0437;&#x044F;&#x0442;&#x0438;&#x044F; &#x043E;&#x0441;&#x0442;&#x0430;&#x0442;&#x043A;&#x0430; &#x043E;&#x0442; &#x0434;&#x0435;&#x043B;&#x0435;&#x043D;&#x0438;&#x044F;, <span 
class="cmmi-10">a</span>, <span 
class="cmmi-10">b </span>&#x0438; <span 
class="cmmi-10">c </span>&#8212;
&#x0437;&#x0430;&#x0434;&#x0430;&#x043D;&#x043D;&#x044B;&#x0435; &#x0446;&#x0435;&#x043B;&#x044B;&#x0435; &#x0447;&#x0438;&#x0441;&#x043B;&#x0430;, &#x0430; &#x0434;&#x043B;&#x044F; &#x043D;&#x043E;&#x043C;&#x0435;&#x0440;&#x0430; &#x044D;&#x043B;&#x0435;&#x043C;&#x0435;&#x043D;&#x0442;&#x0430; &#x043C;&#x0430;&#x0441;&#x0441;&#x0438;&#x0432;&#x0430; <span 
class="cmmi-10">i </span>&#x0432;&#x044B;&#x043F;&#x043E;&#x043B;&#x043D;&#x044F;&#x0435;&#x0442;&#x0441;&#x044F;
&#x043E;&#x0433;&#x0440;&#x0430;&#x043D;&#x0438;&#x0447;&#x0435;&#x043D;&#x0438;&#x0435; <span 
class="cmr-10">1 </span><span 
class="msam-10">&le; </span><span 
class="cmmi-10">i </span><span 
class="msam-10">&le; </span><span 
class="cmmi-10">n</span>.
<!--l. 19--><p class="indent" >   &#x0414;&#x0435;&#x0432;&#x043E;&#x0447;&#x043A;&#x0438; &#x0442;&#x0440;&#x0443;&#x0434;&#x0438;&#x043B;&#x0438;&#x0441;&#x044C; &#x0432;&#x0441;&#x044E; &#x043D;&#x043E;&#x0447;&#x044C;, &#x043D;&#x043E; &#x0442;&#x0430;&#x043A; &#x0438; &#x043D;&#x0435; &#x0441;&#x043C;&#x043E;&#x0433;&#x043B;&#x0438; &#x043E;&#x0442;&#x0441;&#x043E;&#x0440;&#x0442;&#x0438;&#x0440;&#x043E;&#x0432;&#x0430;&#x0442;&#x044C; &#x0432;&#x0441;&#x0435; &#x0435;&#x0433;&#x043E;
&#x044D;&#x043B;&#x0435;&#x043C;&#x0435;&#x043D;&#x0442;&#x044B; &#x0432; &#x043F;&#x043E;&#x0440;&#x044F;&#x0434;&#x043A;&#x0435; &#x043D;&#x0435;&#x0443;&#x0431;&#x044B;&#x0432;&#x0430;&#x043D;&#x0438;&#x044F;.
<!--l. 21--><p class="indent" >   &#x041E;&#x0447;&#x0435;&#x043D;&#x044C; &#x0441;&#x043A;&#x043E;&#x0440;&#x043E; &#x044F;&#x0432;&#x044F;&#x0442;&#x0441;&#x044F; &#x043E;&#x0440;&#x0433;&#x0430;&#x043D;&#x0438;&#x0437;&#x0430;&#x0442;&#x043E;&#x0440;&#x044B; &#x0438; &#x0431;&#x0443;&#x0434;&#x0443;&#x0442; &#x0437;&#x0430;&#x0434;&#x0430;&#x0432;&#x0430;&#x0442;&#x044C; &#x0432;&#x043E;&#x043F;&#x0440;&#x043E;&#x0441;&#x044B; &#x0432;&#x0438;&#x0434;&#x0430; «&#x041A;&#x0430;&#x043A;&#x043E;&#x0439;
&#x044D;&#x043B;&#x0435;&#x043C;&#x0435;&#x043D;&#x0442; &#x043C;&#x0430;&#x0441;&#x0441;&#x0438;&#x0432;&#x0430; <span 
class="cmmi-10">q </span>&#x043F;&#x043E;&#x0441;&#x043B;&#x0435; &#x0441;&#x043E;&#x0440;&#x0442;&#x0438;&#x0440;&#x043E;&#x0432;&#x043A;&#x0438; &#x043D;&#x0430;&#x0445;&#x043E;&#x0434;&#x0438;&#x0442;&#x0441;&#x044F; &#x043D;&#x0430; &#x043F;&#x043E;&#x0437;&#x0438;&#x0446;&#x0438;&#x0438; &#x0441; &#x043D;&#x043E;&#x043C;&#x0435;&#x0440;&#x043E;&#x043C; <span 
class="cmmi-10">p</span><sub><span 
class="cmmi-7">i</span></sub>».
&#x0421;&#x043C;&#x043E;&#x0436;&#x0435;&#x0442;&#x0435; &#x043B;&#x0438; &#x0432;&#x044B; &#x043F;&#x043E;&#x043C;&#x043E;&#x0447;&#x044C; &#x041D;&#x0430;&#x0441;&#x0442;&#x0435; &#x0438; &#x041E;&#x043B;&#x0435;&#x0441;&#x0435; &#x043E;&#x0442;&#x0432;&#x0435;&#x0442;&#x0438;&#x0442;&#x044C; &#x043D;&#x0430; &#x0432;&#x0441;&#x0435; &#x044D;&#x0442;&#x0438; &#x0432;&#x043E;&#x043F;&#x0440;&#x043E;&#x0441;&#x044B;?
 
</body></html> 



