<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//RU"  
  "http://www.w3.org/TR/html4/loose.dtd">  
<html xml:lang="ru" > 
<head><title></title> 
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-5"> 
<meta name="generator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<meta name="originator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<!-- html --> 
<meta name="src" content="tempTex.tex"> 
<meta name="date" content="2018-05-07 00:48:00"> 
<link rel="stylesheet" type="text/css" href="tempTex.css"> 
</head><body 
>
<!--l. 9--><p class="noindent" >&#x041C;&#x0435;&#x0442;&#x0440;&#x043E;&#x043F;&#x043E;&#x043B;&#x0438;&#x0442;&#x0435;&#x043D; &#x0441;&#x043E;&#x0441;&#x0442;&#x043E;&#x0438;&#x0442; &#x0438;&#x0437; &#x043D;&#x0435;&#x0441;&#x043A;&#x043E;&#x043B;&#x044C;&#x043A;&#x0438;&#x0445; &#x043B;&#x0438;&#x043D;&#x0438;&#x0439; &#x043C;&#x0435;&#x0442;&#x0440;&#x043E;. &#x0412;&#x0441;&#x0435; &#x0441;&#x0442;&#x0430;&#x043D;&#x0446;&#x0438;&#x0438; &#x043C;&#x0435;&#x0442;&#x0440;&#x043E; &#x0432; &#x0433;&#x043E;&#x0440;&#x043E;&#x0434;&#x0435;
&#x043F;&#x0440;&#x043E;&#x043D;&#x0443;&#x043C;&#x0435;&#x0440;&#x043E;&#x0432;&#x0430;&#x043D;&#x044B; &#x043D;&#x0430;&#x0442;&#x0443;&#x0440;&#x0430;&#x043B;&#x044C;&#x043D;&#x044B;&#x043C;&#x0438; &#x0447;&#x0438;&#x0441;&#x043B;&#x0430;&#x043C;&#x0438; &#x043E;&#x0442; 1 &#x0434;&#x043E; <span 
class="cmmi-10">N</span>. &#x041D;&#x0430; &#x043A;&#x0430;&#x0436;&#x0434;&#x043E;&#x0439; &#x043B;&#x0438;&#x043D;&#x0438;&#x0438;
&#x0440;&#x0430;&#x0441;&#x043F;&#x043E;&#x043B;&#x043E;&#x0436;&#x0435;&#x043D;&#x043E; &#x043D;&#x0435;&#x0441;&#x043A;&#x043E;&#x043B;&#x044C;&#x043A;&#x043E; &#x0441;&#x0442;&#x0430;&#x043D;&#x0446;&#x0438;&#x0439;. &#x0415;&#x0441;&#x043B;&#x0438; &#x043E;&#x0434;&#x043D;&#x0430; &#x0438; &#x0442;&#x0430; &#x0436;&#x0435; &#x0441;&#x0442;&#x0430;&#x043D;&#x0446;&#x0438;&#x044F; &#x0440;&#x0430;&#x0441;&#x043F;&#x043E;&#x043B;&#x043E;&#x0436;&#x0435;&#x043D;&#x0430; &#x0441;&#x0440;&#x0430;&#x0437;&#x0443;
&#x043D;&#x0430; &#x043D;&#x0435;&#x0441;&#x043A;&#x043E;&#x043B;&#x044C;&#x043A;&#x0438;&#x0445; &#x043B;&#x0438;&#x043D;&#x0438;&#x044F;&#x0445;, &#x0442;&#x043E; &#x043E;&#x043D;&#x0430; &#x044F;&#x0432;&#x043B;&#x044F;&#x0435;&#x0442;&#x0441;&#x044F; &#x0441;&#x0442;&#x0430;&#x043D;&#x0446;&#x0438;&#x0435;&#x0439; &#x043F;&#x0435;&#x0440;&#x0435;&#x0441;&#x0430;&#x0434;&#x043A;&#x0438;, &#x0438; &#x043D;&#x0430; &#x044D;&#x0442;&#x043E;&#x0439; &#x0441;&#x0442;&#x0430;&#x043D;&#x0446;&#x0438;&#x0438;
&#x043C;&#x043E;&#x0436;&#x043D;&#x043E; &#x043F;&#x0435;&#x0440;&#x0435;&#x0441;&#x0435;&#x0441;&#x0442;&#x044C; &#x0441; &#x043B;&#x044E;&#x0431;&#x043E;&#x0439; &#x043B;&#x0438;&#x043D;&#x0438;&#x0438;, &#x043A;&#x043E;&#x0442;&#x043E;&#x0440;&#x0430;&#x044F; &#x0447;&#x0435;&#x0440;&#x0435;&#x0437; &#x043D;&#x0435;&#x0435; &#x043F;&#x0440;&#x043E;&#x0445;&#x043E;&#x0434;&#x0438;&#x0442;, &#x043D;&#x0430; &#x043B;&#x044E;&#x0431;&#x0443;&#x044E; &#x0434;&#x0440;&#x0443;&#x0433;&#x0443;&#x044E;,
&#x043E;&#x043F;&#x044F;&#x0442;&#x044C; &#x0436;&#x0435;, &#x043F;&#x0440;&#x043E;&#x0445;&#x043E;&#x0434;&#x044F;&#x0449;&#x0443;&#x044E; &#x0447;&#x0435;&#x0440;&#x0435;&#x0437; &#x043D;&#x0435;&#x0435;.
<!--l. 11--><p class="indent" >   &#x041D;&#x0430;&#x043F;&#x0438;&#x0448;&#x0438;&#x0442;&#x0435; &#x043F;&#x0440;&#x043E;&#x0433;&#x0440;&#x0430;&#x043C;&#x043C;&#x0443;, &#x043A;&#x043E;&#x0442;&#x043E;&#x0440;&#x0430;&#x044F; &#x043F;&#x043E; &#x0434;&#x0430;&#x043D;&#x043D;&#x043E;&#x043C;&#x0443; &#x0432;&#x0430;&#x043C; &#x043E;&#x043F;&#x0438;&#x0441;&#x0430;&#x043D;&#x0438;&#x044E; &#x043C;&#x0435;&#x0442;&#x0440;&#x043E;&#x043F;&#x043E;&#x043B;&#x0438;&#x0442;&#x0435;&#x043D;&#x0430;
&#x043E;&#x043F;&#x0440;&#x0435;&#x0434;&#x0435;&#x043B;&#x0438;&#x0442;, &#x0441; &#x043A;&#x0430;&#x043A;&#x0438;&#x043C; &#x043C;&#x0438;&#x043D;&#x0438;&#x043C;&#x0430;&#x043B;&#x044C;&#x043D;&#x044B;&#x043C; &#x0447;&#x0438;&#x0441;&#x043B;&#x043E;&#x043C; &#x043F;&#x0435;&#x0440;&#x0435;&#x0441;&#x0430;&#x0434;&#x043E;&#x043A; &#x043C;&#x043E;&#x0436;&#x043D;&#x043E; &#x0434;&#x043E;&#x0431;&#x0440;&#x0430;&#x0442;&#x044C;&#x0441;&#x044F; &#x0441;&#x043E;
&#x0441;&#x0442;&#x0430;&#x043D;&#x0446;&#x0438;&#x0438; <span 
class="cmmi-10">A </span>&#x043D;&#x0430; &#x0441;&#x0442;&#x0430;&#x043D;&#x0446;&#x0438;&#x044E; <span 
class="cmmi-10">B</span>. &#x0415;&#x0441;&#x043B;&#x0438; &#x0441;&#x043E; &#x0441;&#x0442;&#x0430;&#x043D;&#x0446;&#x0438;&#x0438; A &#x043D;&#x0430; &#x0441;&#x0442;&#x0430;&#x043D;&#x0446;&#x0438;&#x044E; B &#x0434;&#x043E;&#x0431;&#x0440;&#x0430;&#x0442;&#x044C;&#x0441;&#x044F;
&#x043D;&#x0435;&#x0432;&#x043E;&#x0437;&#x043C;&#x043E;&#x0436;&#x043D;&#x043E;, &#x0432;&#x0430;&#x0448;&#x0430; &#x043F;&#x0440;&#x043E;&#x0433;&#x0440;&#x0430;&#x043C;&#x043C;&#x0430; &#x0434;&#x043E;&#x043B;&#x0436;&#x043D;&#x0430; &#x0432;&#x044B;&#x0432;&#x0435;&#x0441;&#x0442;&#x0438; <span 
class="latt-1000">-1</span>.
    
</body></html> 



