<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//RU"  
  "http://www.w3.org/TR/html4/loose.dtd">  
<html xml:lang="ru" > 
<head><title></title> 
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-5"> 
<meta name="generator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<meta name="originator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<!-- html --> 
<meta name="src" content="tempTex.tex"> 
<meta name="date" content="2018-05-07 00:48:00"> 
<link rel="stylesheet" type="text/css" href="tempTex.css"> 
</head><body 
>
<!--l. 9--><p class="noindent" >Input:
<!--l. 11--><p class="indent" >   &#x0412;&#x043E; &#x043F;&#x0435;&#x0440;&#x0432;&#x043E;&#x0439; &#x0441;&#x0442;&#x0440;&#x043E;&#x043A;&#x0435; &#x0432;&#x0445;&#x043E;&#x0434;&#x043D;&#x044B;&#x0445; &#x0434;&#x0430;&#x043D;&#x043D;&#x044B;&#x0445; &#x0437;&#x0430;&#x043F;&#x0438;&#x0441;&#x0430;&#x043D;&#x043E; &#x0447;&#x0438;&#x0441;&#x043B;&#x043E; <span 
class="cmmi-10">N </span>&#8212; &#x043A;&#x043E;&#x043B;&#x0438;&#x0447;&#x0435;&#x0441;&#x0442;&#x0432;&#x043E; &#x0441;&#x0442;&#x0430;&#x043D;&#x0446;&#x0438;&#x0439;
&#x043C;&#x0435;&#x0442;&#x0440;&#x043E; &#x0432; &#x0433;&#x043E;&#x0440;&#x043E;&#x0434;&#x0435; (<span 
class="cmr-10">1 </span><span 
class="msam-10">&le; </span><span 
class="cmmi-10">N </span><span 
class="msam-10">&le; </span><span 
class="cmr-10">100</span>). &#x0412;&#x043E; &#x0432;&#x0442;&#x043E;&#x0440;&#x043E;&#x0439; &#x0441;&#x0442;&#x0440;&#x043E;&#x043A;&#x0435; &#x0437;&#x0430;&#x0434;&#x0430;&#x043D;&#x043E; &#x0447;&#x0438;&#x0441;&#x043B;&#x043E; <span 
class="cmmi-10">M </span>&#8212; &#x043A;&#x043E;&#x043B;&#x0438;&#x0447;&#x0435;&#x0441;&#x0442;&#x0432;&#x043E;
&#x043B;&#x0438;&#x043D;&#x0438;&#x0439; &#x043C;&#x0435;&#x0442;&#x0440;&#x043E; (<span 
class="cmr-10">1 </span><span 
class="msam-10">&le; </span><span 
class="cmmi-10">M </span><span 
class="msam-10">&le; </span><span 
class="cmr-10">20</span>). &#x0414;&#x0430;&#x043B;&#x0435;&#x0435; &#x0438;&#x0434;&#x0435;&#x0442; &#x043E;&#x043F;&#x0438;&#x0441;&#x0430;&#x043D;&#x0438;&#x0435; <span 
class="cmmi-10">M </span>&#x043B;&#x0438;&#x043D;&#x0438;&#x0439;. &#x041E;&#x043F;&#x0438;&#x0441;&#x0430;&#x043D;&#x0438;&#x0435; &#x043A;&#x0430;&#x0436;&#x0434;&#x043E;&#x0439;
&#x043B;&#x0438;&#x043D;&#x0438;&#x0438; &#x0440;&#x0430;&#x0441;&#x043F;&#x043E;&#x043B;&#x043E;&#x0436;&#x0435;&#x043D;&#x043E; &#x043D;&#x0430; &#x043E;&#x0442;&#x0434;&#x0435;&#x043B;&#x044C;&#x043D;&#x043E;&#x0439; &#x0441;&#x0442;&#x0440;&#x043E;&#x043A;&#x0435; &#x0438; &#x0441;&#x043E;&#x0441;&#x0442;&#x043E;&#x0438;&#x0442; &#x0438;&#x0437; &#x0447;&#x0438;&#x0441;&#x043B;&#x0430; <span 
class="cmmi-10">P</span><sub><span 
class="cmmi-7">i</span></sub> &#8212; &#x043A;&#x043E;&#x043B;&#x0438;&#x0447;&#x0435;&#x0441;&#x0442;&#x0432;&#x0430;
&#x0441;&#x0442;&#x0430;&#x043D;&#x0446;&#x0438;&#x0439; &#x043D;&#x0430; &#x044D;&#x0442;&#x043E;&#x0439; &#x043B;&#x0438;&#x043D;&#x0438;&#x0438; (<span 
class="cmr-10">1 </span><span 
class="msam-10">&le; </span><span 
class="cmmi-10">P</span><sub><span 
class="cmmi-7">i</span></sub> <span 
class="msam-10">&le; </span><span 
class="cmr-10">50</span>) &#x0438; <span 
class="cmmi-10">P</span><sub><span 
class="cmmi-7">i</span></sub> &#x0447;&#x0438;&#x0441;&#x0435;&#x043B;, &#x0437;&#x0430;&#x0434;&#x0430;&#x044E;&#x0449;&#x0438;&#x0445; &#x043D;&#x043E;&#x043C;&#x0435;&#x0440;&#x0430; &#x0441;&#x0442;&#x0430;&#x043D;&#x0446;&#x0438;&#x0439;,
&#x0447;&#x0435;&#x0440;&#x0435;&#x0437; &#x043A;&#x043E;&#x0442;&#x043E;&#x0440;&#x044B;&#x0435; &#x043F;&#x0440;&#x043E;&#x0445;&#x043E;&#x0434;&#x0438;&#x0442; &#x043B;&#x0438;&#x043D;&#x0438;&#x044F;. &#x041B;&#x0438;&#x043D;&#x0438;&#x044F; &#x043D;&#x0438;&#x043A;&#x043E;&#x0433;&#x0434;&#x0430; &#x043D;&#x0435; &#x043F;&#x0440;&#x043E;&#x0445;&#x043E;&#x0434;&#x0438;&#x0442; &#x0447;&#x0435;&#x0440;&#x0435;&#x0437; &#x043E;&#x0434;&#x043D;&#x0443; &#x0438; &#x0442;&#x0443; &#x0436;&#x0435;
&#x0441;&#x0442;&#x0430;&#x043D;&#x0446;&#x0438;&#x044E; &#x0434;&#x0432;&#x0430;&#x0436;&#x0434;&#x044B;. &#x0412; &#x043A;&#x043E;&#x043D;&#x0446;&#x0435; &#x0444;&#x0430;&#x0439;&#x043B;&#x0430; &#x0437;&#x0430;&#x043F;&#x0438;&#x0441;&#x0430;&#x043D;&#x044B; &#x0434;&#x0432;&#x0430; &#x0440;&#x0430;&#x0437;&#x043B;&#x0438;&#x0447;&#x043D;&#x044B;&#x0445; &#x0447;&#x0438;&#x0441;&#x043B;&#x0430;: <span 
class="cmmi-10">A </span>&#8212;
&#x043D;&#x043E;&#x043C;&#x0435;&#x0440; &#x043D;&#x0430;&#x0447;&#x0430;&#x043B;&#x044C;&#x043D;&#x043E;&#x0439; &#x0441;&#x0442;&#x0430;&#x043D;&#x0446;&#x0438;&#x0438;, &#x0438; <span 
class="cmmi-10">B </span>&#8212; &#x043D;&#x043E;&#x043C;&#x0435;&#x0440; &#x0441;&#x0442;&#x0430;&#x043D;&#x0446;&#x0438;&#x0438;, &#x043D;&#x0430; &#x043A;&#x043E;&#x0442;&#x043E;&#x0440;&#x0443;&#x044E; &#x043D;&#x0430;&#x043C; &#x043D;&#x0443;&#x0436;&#x043D;&#x043E;
&#x043F;&#x043E;&#x043F;&#x0430;&#x0441;&#x0442;&#x044C;.
<!--l. 17--><p class="indent" >   Output:
<!--l. 19--><p class="indent" >   &#x0412;&#x044B;&#x0432;&#x0435;&#x0434;&#x0438;&#x0442;&#x0435; &#x043C;&#x0438;&#x043D;&#x0438;&#x043C;&#x0430;&#x043B;&#x044C;&#x043D;&#x043E;&#x0435; &#x0442;&#x0440;&#x0435;&#x0431;&#x0443;&#x0435;&#x043C;&#x043E;&#x0435; &#x043A;&#x043E;&#x043B;&#x0438;&#x0447;&#x0435;&#x0441;&#x0442;&#x0432;&#x043E; &#x043F;&#x0435;&#x0440;&#x0435;&#x0441;&#x0430;&#x0434;&#x043E;&#x043A;. &#x0415;&#x0441;&#x043B;&#x0438; &#x0434;&#x043E;&#x0431;&#x0440;&#x0430;&#x0442;&#x044C;&#x0441;&#x044F; &#x0441;&#x043E;
&#x0441;&#x0442;&#x0430;&#x043D;&#x0446;&#x0438;&#x0438; <span 
class="cmmi-10">A </span>&#x043D;&#x0430; &#x0441;&#x0442;&#x0430;&#x043D;&#x0446;&#x0438;&#x044E; <span 
class="cmmi-10">B </span>&#x043D;&#x0435;&#x0432;&#x043E;&#x0437;&#x043C;&#x043E;&#x0436;&#x043D;&#x043E;, &#x0442;&#x043E; &#x0441;&#x043B;&#x0435;&#x0434;&#x0443;&#x0435;&#x0442; &#x0432;&#x044B;&#x0432;&#x0435;&#x0441;&#x0442;&#x0438; &#x0435;&#x0434;&#x0438;&#x043D;&#x0441;&#x0442;&#x0432;&#x0435;&#x043D;&#x043D;&#x043E;&#x0435; &#x0447;&#x0438;&#x0441;&#x043B;&#x043E; <span 
class="latt-1000">&#8211;1</span>
(&#x043C;&#x0438;&#x043D;&#x0443;&#x0441; &#x0435;&#x0434;&#x0438;&#x043D;&#x0438;&#x0446;&#x0430;).  
</body></html> 



