<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//RU"  
  "http://www.w3.org/TR/html4/loose.dtd">  
<html xml:lang="ru" > 
<head><title></title> 
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-5"> 
<meta name="generator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<meta name="originator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)"> 
<!-- html --> 
<meta name="src" content="tempTex.tex"> 
<meta name="date" content="2018-05-07 00:50:00"> 
<link rel="stylesheet" type="text/css" href="tempTex.css"> 
</head><body 
>
<!--l. 9--><p class="noindent" >&#x041E;&#x0434;&#x043D;&#x0430;&#x0436;&#x0434;&#x044B;, &#x0432;&#x043E; &#x0432;&#x0440;&#x0435;&#x043C;&#x044F; &#x043E;&#x0431;&#x0435;&#x0434;&#x0435;&#x043D;&#x043D;&#x043E;&#x0433;&#x043E; &#x043F;&#x0435;&#x0440;&#x0435;&#x0440;&#x044B;&#x0432;&#x0430;, &#x041F;&#x0430;&#x0448;&#x0430; &#x0440;&#x0435;&#x0448;&#x0438;&#x043B; &#x0441;&#x0445;&#x043E;&#x0434;&#x0438;&#x0442;&#x044C; &#x0432; &#x0441;&#x0442;&#x043E;&#x043B;&#x043E;&#x0432;&#x0443;&#x044E;
&#x0433;&#x043B;&#x0430;&#x0432;&#x043D;&#x043E;&#x0433;&#x043E; &#x043A;&#x043E;&#x0440;&#x043F;&#x0443;&#x0441;&#x0430; &#x0422;&#x0435;&#x0440;&#x043B;&#x044F;&#x043D;&#x0441;&#x043A;&#x043E;&#x0433;&#x043E; &#x041F;&#x0443;&#x0431;&#x043B;&#x0438;&#x0446;&#x0438;&#x0441;&#x0442;&#x0438;&#x0447;&#x0435;&#x0441;&#x043A;&#x043E;&#x0433;&#x043E; &#x0423;&#x043D;&#x0438;&#x0432;&#x0435;&#x0440;&#x0441;&#x0438;&#x0442;&#x0435;&#x0442;&#x0430; (&#x0422;&#x041F;&#x0423;). &#x0421;&#x0434;&#x0435;&#x043B;&#x0430;&#x0432;
&#x0441;&#x0432;&#x043E;&#x0439; &#x0437;&#x0430;&#x043A;&#x0430;&#x0437;, &#x043E;&#x043D; &#x0441;&#x0442;&#x0430;&#x043B; &#x0436;&#x0434;&#x0430;&#x0442;&#x044C;, &#x043F;&#x043E;&#x043A;&#x0430; &#x0440;&#x0430;&#x0431;&#x043E;&#x0442;&#x043D;&#x0438;&#x0446;&#x0430; &#x043F;&#x043E;&#x0441;&#x0447;&#x0438;&#x0442;&#x0430;&#x0435;&#x0442;, &#x0441;&#x043A;&#x043E;&#x043B;&#x044C;&#x043A;&#x043E; &#x041F;&#x0430;&#x0448;&#x0430; &#x0434;&#x043E;&#x043B;&#x0436;&#x0435;&#x043D;
&#x0437;&#x0430;&#x043F;&#x043B;&#x0430;&#x0442;&#x0438;&#x0442;&#x044C;. &#x0414;&#x043B;&#x044F; &#x0442;&#x043E;&#x0433;&#x043E;, &#x0447;&#x0442;&#x043E;&#x0431;&#x044B; &#x0432;&#x044B;&#x043F;&#x043E;&#x043B;&#x043D;&#x0438;&#x0442;&#x044C; &#x044D;&#x0442;&#x0443; &#x043D;&#x0435;&#x043F;&#x0440;&#x043E;&#x0441;&#x0442;&#x0443;&#x044E; &#x0437;&#x0430;&#x0434;&#x0430;&#x0447;&#x0443;, &#x043E;&#x043D;&#x0430; &#x0438;&#x0441;&#x043F;&#x043E;&#x043B;&#x044C;&#x0437;&#x043E;&#x0432;&#x0430;&#x043B;&#x0430;
&#x0441;&#x0447;&#x0435;&#x0442;&#x044B;.
<div class="center" 
>
<!--l. 10--><p class="noindent" >
<!--l. 11--><p class="noindent" ><img 
src="abacus.png" alt="PIC"  
width="100.375pt" height="140.525pt" ></div>
<!--l. 14--><p class="indent" >   &#x0421;&#x0447;&#x0435;&#x0442;&#x044B; &#x043F;&#x0440;&#x0435;&#x0434;&#x0441;&#x0442;&#x0430;&#x0432;&#x043B;&#x044F;&#x044E;&#x0442; &#x0441;&#x043E;&#x0431;&#x043E;&#x0439; &#x0440;&#x0430;&#x043C;&#x0443;, &#x0438;&#x043C;&#x0435;&#x044E;&#x0449;&#x0435;&#x044E; &#x0432;&#x043E;&#x0441;&#x0435;&#x043C;&#x044C; &#x0441;&#x043F;&#x0438;&#x0446;, &#x043D;&#x0430; &#x043A;&#x043E;&#x0442;&#x043E;&#x0440;&#x0443;&#x044E;
&#x043D;&#x0430;&#x043D;&#x0438;&#x0437;&#x0430;&#x043D;&#x044B; &#x043F;&#x043E; &#x0434;&#x0435;&#x0432;&#x044F;&#x0442;&#x044C; &#x043A;&#x043E;&#x0441;&#x0442;&#x044F;&#x0448;&#x0435;&#x043A;. &#x041A;&#x0430;&#x0436;&#x0434;&#x044B;&#x0439; &#x0440;&#x044F;&#x0434; &#x043A;&#x043E;&#x0441;&#x0442;&#x044F;&#x0448;&#x0435;&#x043A; &#x043F;&#x0440;&#x0435;&#x0434;&#x0441;&#x0442;&#x0430;&#x0432;&#x043B;&#x044F;&#x0435;&#x0442;
&#x0441;&#x043E;&#x0431;&#x043E;&#x0439; &#x0447;&#x0438;&#x0441;&#x043B;&#x043E;&#x0432;&#x043E;&#x0439; &#x0440;&#x0430;&#x0437;&#x0440;&#x044F;&#x0434;. &#x0420;&#x0430;&#x0437;&#x0440;&#x044F;&#x0434;&#x044B; &#x0440;&#x0430;&#x0441;&#x043F;&#x043E;&#x043B;&#x043E;&#x0436;&#x0435;&#x043D;&#x044B; &#x043F;&#x043E; &#x0432;&#x043E;&#x0437;&#x0440;&#x0430;&#x0441;&#x0442;&#x0430;&#x043D;&#x0438;&#x044E;. &#x0422;&#x0430;&#x043A;&#x0438;&#x043C;
&#x043E;&#x0431;&#x0440;&#x0430;&#x0437;&#x043E;&#x043C;, &#x043D;&#x0438;&#x0436;&#x043D;&#x044F;&#x044F; &#x0441;&#x043F;&#x0438;&#x0446;&#x0430; &#x043F;&#x0440;&#x0435;&#x0434;&#x0441;&#x0442;&#x0430;&#x0432;&#x043B;&#x044F;&#x0435;&#x0442; &#x0441;&#x043E;&#x0431;&#x043E;&#x0439; &#x0440;&#x0430;&#x0437;&#x0440;&#x044F;&#x0434; &#x0435;&#x0434;&#x0438;&#x043D;&#x0438;&#x0446;, &#x0430; &#x0432;&#x043E;&#x0441;&#x044C;&#x043C;&#x0430;&#x044F; &#8212;
&#x0440;&#x0430;&#x0437;&#x0440;&#x044F;&#x0434; &#x0434;&#x0435;&#x0441;&#x044F;&#x0442;&#x043A;&#x043E;&#x0432; &#x043C;&#x0438;&#x043B;&#x043B;&#x0438;&#x043E;&#x043D;&#x043E;&#x0432;. &#x041F;&#x0435;&#x0440;&#x0432;&#x043E;&#x043D;&#x0430;&#x0447;&#x0430;&#x043B;&#x044C;&#x043D;&#x043E; &#x0432;&#x0441;&#x0435; &#x043A;&#x043E;&#x0441;&#x0442;&#x044F;&#x0448;&#x043A;&#x0438; &#x0441;&#x0434;&#x0432;&#x0438;&#x043D;&#x0443;&#x0442;&#x044B;
<span 
class="labx-1000">&#x0432;&#x043F;&#x0440;&#x0430;&#x0432;&#x043E;</span>, &#x0438; &#x0440;&#x0435;&#x0437;&#x0443;&#x043B;&#x044C;&#x0442;&#x0438;&#x0440;&#x0443;&#x044E;&#x0449;&#x0430;&#x044F; &#x0441;&#x0443;&#x043C;&#x043C;&#x0430; &#8212; &#x043D;&#x043E;&#x043B;&#x044C;. &#x0421;&#x0434;&#x0432;&#x0438;&#x0433;&#x0430;&#x044F; &#x043A;&#x043E;&#x0441;&#x0442;&#x044F;&#x0448;&#x043A;&#x0438; <span 
class="labx-1000">&#x0432;&#x043B;&#x0435;&#x0432;&#x043E;</span>, &#x043A;
&#x0440;&#x0435;&#x0437;&#x0443;&#x043B;&#x044C;&#x0442;&#x0438;&#x0440;&#x0443;&#x044E;&#x0449;&#x0435;&#x0439; &#x0441;&#x0443;&#x043C;&#x043C;&#x0435; &#x043F;&#x0440;&#x0438;&#x0431;&#x0430;&#x0432;&#x043B;&#x044F;&#x0435;&#x0442;&#x0441;&#x044F; &#x0440;&#x0430;&#x0437;&#x0440;&#x044F;&#x0434; &#x044D;&#x0442;&#x043E;&#x0439; &#x043A;&#x043E;&#x0441;&#x0442;&#x044F;&#x0448;&#x043A;&#x0438; &#x0443;&#x043C;&#x043D;&#x043E;&#x0436;&#x0435;&#x043D;&#x043D;&#x044B;&#x0439; &#x043D;&#x0430; &#x0438;&#x0445;
&#x043A;&#x043E;&#x043B;&#x0438;&#x0447;&#x0435;&#x0441;&#x0442;&#x0432;&#x043E;.
<!--l. 16--><p class="indent" >   &#x041F;&#x043E;&#x043A;&#x0430; &#x0432;&#x044B; &#x0438;&#x0437;&#x0443;&#x0447;&#x0430;&#x043B;&#x0438; &#x044D;&#x0442;&#x0443; &#x0438;&#x043D;&#x0444;&#x043E;&#x0440;&#x043C;&#x0430;&#x0446;&#x0438;&#x044E;, &#x0440;&#x0430;&#x0431;&#x043E;&#x0442;&#x043D;&#x0438;&#x0446;&#x0430; &#x043D;&#x0430;&#x043A;&#x043E;&#x043D;&#x0435;&#x0446;-&#x0442;&#x043E; &#x0441;&#x0434;&#x0432;&#x0438;&#x043D;&#x0443;&#x043B;&#x0430;
&#x0432;&#x043B;&#x0435;&#x0432;&#x043E; &#x0432;&#x0441;&#x0435; &#x043D;&#x0443;&#x0436;&#x043D;&#x044B;&#x0435; &#x043A;&#x043E;&#x0441;&#x0442;&#x044F;&#x0448;&#x043A;&#x0438;. &#x041E;&#x043D;&#x0430; &#x043D;&#x0430;&#x0437;&#x0432;&#x0430;&#x043B;&#x0430; &#x041F;&#x0430;&#x0448;&#x0435; &#x0441;&#x0443;&#x043C;&#x043C;&#x0443; &#x0438; &#x043F;&#x043E;&#x043A;&#x0430;&#x0437;&#x0430;&#x043B;&#x0430; &#x0435;&#x043C;&#x0443;
&#x0441;&#x0447;&#x0435;&#x0442;&#x044B; &#x0432; &#x043F;&#x043E;&#x0434;&#x0442;&#x0432;&#x0435;&#x0440;&#x0436;&#x0434;&#x0435;&#x043D;&#x0438;&#x0435; &#x0441;&#x0432;&#x043E;&#x0438;&#x0445; &#x0441;&#x043B;&#x043E;&#x0432;. &#x041D;&#x043E;, &#x043A; &#x0441;&#x043E;&#x0436;&#x0430;&#x043B;&#x0435;&#x043D;&#x0438;&#x044E;, &#x041F;&#x0430;&#x0432;&#x0435;&#x043B; &#x043D;&#x0430;&#x0441;&#x0442;&#x043E;&#x043B;&#x044C;&#x043A;&#x043E;
&#x043F;&#x0440;&#x0438;&#x0432;&#x044B;&#x043A; &#x043A; &#x0441;&#x043E;&#x0432;&#x0440;&#x0435;&#x043C;&#x0435;&#x043D;&#x043D;&#x044B;&#x043C; &#x043A;&#x0430;&#x043B;&#x044C;&#x043A;&#x0443;&#x043B;&#x044F;&#x0442;&#x043E;&#x0440;&#x0430;&#x043C;, &#x0447;&#x0442;&#x043E; &#x043E;&#x043D; &#x043D;&#x0435; &#x0443;&#x043C;&#x0435;&#x0435;&#x0442; &#x043F;&#x043E;&#x043B;&#x044C;&#x0437;&#x043E;&#x0432;&#x0430;&#x0442;&#x044C;&#x0441;&#x044F;
&#x0441;&#x0447;&#x0435;&#x0442;&#x0430;&#x043C;&#x0438;. &#x0418; &#x043F;&#x0440;&#x043E;&#x0432;&#x0435;&#x0440;&#x0438;&#x0442;&#x044C; &#x043F;&#x0440;&#x0430;&#x0432;&#x0434;&#x0438;&#x0432;&#x043E;&#x0441;&#x0442;&#x044C; &#x0441;&#x043B;&#x043E;&#x0432; &#x0440;&#x0430;&#x0431;&#x043E;&#x0442;&#x043D;&#x0438;&#x0446;&#x044B; &#x043D;&#x0435; &#x043C;&#x043E;&#x0436;&#x0435;&#x0442;. &#x041F;&#x043E;&#x044D;&#x0442;&#x043E;&#x043C;&#x0443; &#x043E;&#x043D;
&#x043F;&#x0440;&#x043E;&#x0441;&#x0438;&#x0442; &#x043F;&#x043E;&#x043C;&#x043E;&#x0447;&#x044C; &#x0432;&#x0430;&#x0441; &#x043F;&#x043E;&#x0441;&#x0447;&#x0438;&#x0442;&#x0430;&#x0442;&#x044C; &#x0441;&#x0442;&#x043E;&#x0438;&#x043C;&#x043E;&#x0441;&#x0442;&#x044C; &#x0435;&#x0433;&#x043E; &#x043E;&#x0431;&#x0435;&#x0434;&#x0430;, &#x0438;&#x0441;&#x043F;&#x043E;&#x043B;&#x044C;&#x0437;&#x0443;&#x044F; &#x0441;&#x0447;&#x0435;&#x0442;&#x044B;.
 
</body></html> 



